#可变数量参数传递练习
'''
#练习1：带一个可变数量参数
#定义函数，一个可变数量参数
def fun1(*p):
    print(type(p))
    print(p)

#调用函数---不提供参数
fun1()

#调用函数---提供5个同类型的参数
fun1(1,2,3,4,5)

#调用函数---提供3个不同类型的参数
fun1("张三",23.56,90)
'''
'''
#练习2：既包含普通参数，又包含可变数量参数
#函数定义
def fun2(num,name,*p2):
    print(num,name)
    print(p2)

def fun3(*p3,num,name):
    print(num,name)
    print(p3)


#调用函数---至少要提供普通参数
fun2(1,"张三")

#调用函数---提供普通参数和可变参数
fun2(2,"李四","北京","汉族")

fun2(3,"王五","北京","汉族",'1001100','67.5KG','1.89M')

#练习3
#将可变参数放在参数列表的前面，普通参数以关键字方式给出
fun3("北京","汉族",'1001100','67.5KG','1.89M',num=4,name='小明')


fun3(num=5,name='小明')
'''
#练习4
#声明一个函数，包含三种类型的参数（普通，默认值，可变）
#函数定义
def fun4(*p4,num=100,name):
    print(num,name)
    print(p4)

#函数调用，为普通参数提供值，可变参数不提供值
fun4(num=200,name='张三')

#函数调用，使用默认值参数
fun4(name="李四",num=300)

#函数调用，全部都提供参数
fun4("北京",20,"18611122639",name="王五",num=400)

#函数调用，省略默认值参数
fun4("北京",20,"18611122639",'67.5KG','1.89M',name="王五")











